In [1]:
from pandas import Series, DataFrame

kakao = Series([92600,92400,92100,94300,92300])
print(kakao)

0    92600
1    92400
2    92100
3    94300
4    92300
dtype: int64

In [4]:
kakao2 = Series([92600,92400,92100,94300,92300], index=['2017-03-03', '2017-03-06', '2017-03-07', '2017-03-08', '2017-03-09'])
print(kakao2)

2017-03-03    92600
2017-03-06    92400
2017-03-07    92100
2017-03-08    94300
2017-03-09    92300
dtype: int64

In [5]:
print(kakao2['2017-03-09'])

92300

In [6]:
import pandas as pd
my_sel = pd.Series([10,20,30], index = ["Samsung","naver","LG"])
my_sel

Samsung    10
naver      20
LG         30
dtype: int64

In [7]:
my_sel.sort_values()

Samsung    10
naver      20
LG         30
dtype: int64

In [9]:
my_sel.sort_index()

LG         30
Samsung    10
naver      20
dtype: int64

In [10]:
buy_stock = pd.Series([20,20,30], index=['Samsung', "naver", "Kako"])
buy_stock

Samsung    20
naver      20
Kako       30
dtype: int64

In [11]:
my_sel + buy_stock

Kako        NaN
LG          NaN
Samsung    30.0
naver      40.0
dtype: float64

In [13]:
new_my_sel = my_sel.add(buy_stock, fill_value=0)
new_my_sel

Kako       30.0
LG         30.0
Samsung    30.0
naver      40.0
dtype: float64

In [16]:
new_my_sel = new_my_sel.astype('int64')
new_my_sel

Kako       30
LG         30
Samsung    30
naver      40
dtype: int64

In [20]:
import pandas as pd

names = ["Bob", "Jessica", "Mary", "John", "kate"]
births = [988,155,77,578,973]

BabySet = list(zip(names,births))
df = pd.DataFrame(data=BabySet, columns=["Names", "Births"])
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Names</th>
      <th>Births</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Bob</td>
      <td>988</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Jessica</td>
      <td>155</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Mary</td>
      <td>77</td>
    </tr>
    <tr>
      <th>3</th>
      <td>John</td>
      <td>578</td>
    </tr>
    <tr>
      <th>4</th>
      <td>kate</td>
      <td>973</td>
    </tr>
  </tbody>
</table>
</div>

In [23]:
area_dic = {'california': 423967, "Texas" : 695662, "New York" : 141297, 'Florida' : 170312, "Illinois" : 149995}
pop_dic = {'california': 1423967, "Texas" : 1695662, "New York" : 1141297, 'Florida' : 1170312, "Illinois" : 1149995}

area = pd.Series(area_dic)
population = pd.Series(pop_dic)

states= pd.DataFrame({'Population' : population, 'Area':area})
states

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Area</th>
      <th>Population</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Florida</th>
      <td>170312</td>
      <td>1170312</td>
    </tr>
    <tr>
      <th>Illinois</th>
      <td>149995</td>
      <td>1149995</td>
    </tr>
    <tr>
      <th>New York</th>
      <td>141297</td>
      <td>1141297</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>695662</td>
      <td>1695662</td>
    </tr>
    <tr>
      <th>california</th>
      <td>423967</td>
      <td>1423967</td>
    </tr>
  </tbody>
</table>
</div>

In [28]:
raw_data = {"col0":[1,2,3,4],
            'col1':[10,20,30,40],
            "col2":[100,200,300,400]}

data = DataFrame(raw_data)
print(data)

data['col0']

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

0    1
1    2
2    3
3    4
Name: col0, dtype: int64

In [31]:
raw_data = {"col0":[1,2,3,4],
            'col1':[10,20,30,40],
            "col2":[100,200,300,400]}
data = pd.DataFrame(raw_data)
data = pd.DataFrame(raw_data, index=['r0','r1','r2','r3'])
data

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>col0</th>
      <th>col1</th>
      <th>col2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>r0</th>
      <td>1</td>
      <td>10</td>
      <td>100</td>
    </tr>
    <tr>
      <th>r1</th>
      <td>2</td>
      <td>20</td>
      <td>200</td>
    </tr>
    <tr>
      <th>r2</th>
      <td>3</td>
      <td>30</td>
      <td>300</td>
    </tr>
    <tr>
      <th>r3</th>
      <td>4</td>
      <td>40</td>
      <td>400</td>
    </tr>
  </tbody>
</table>
</div>

In [35]:
raw_data = {"col0":[1,2,3,4],
            'col1':[10,20,30,40],
            "col2":[100,200,300,400]}

data = pd.DataFrame(raw_data, columns=['col1','col2','col0'])
data

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>col1</th>
      <th>col2</th>
      <th>col0</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>10</td>
      <td>100</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>20</td>
      <td>200</td>
      <td>2</td>
    </tr>
    <tr>
      <th>2</th>
      <td>30</td>
      <td>300</td>
      <td>3</td>
    </tr>
    <tr>
      <th>3</th>
      <td>40</td>
      <td>400</td>
      <td>4</td>
    </tr>
  </tbody>
</table>
</div>

In [36]:
df=data.reindex(index=[0,3,2,1])
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>col1</th>
      <th>col2</th>
      <th>col0</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>10</td>
      <td>100</td>
      <td>1</td>
    </tr>
    <tr>
      <th>3</th>
      <td>40</td>
      <td>400</td>
      <td>4</td>
    </tr>
    <tr>
      <th>2</th>
      <td>30</td>
      <td>300</td>
      <td>3</td>
    </tr>
    <tr>
      <th>1</th>
      <td>20</td>
      <td>200</td>
      <td>2</td>
    </tr>
  </tbody>
</table>
</div>

In [58]:
import pandas as pd

raw_data = {
'open' : [10950,11150,11050,10950,10950,11000,11100,11200,11100,11650],
'high' : [11120,11300,11200,11100,11050,11150,11100,11200,11800,12100],
'low' : [10850,10800,10950,10800,10850,10900,10950,10900,11050,11600],
'close' : [11050,10800,11050,11050,10950,11050,11100,11000,11600,11900]
}
date = ["16.02.16","16.02.17","16.02.18","16.02.19","16.02.22","16.02.23","16.02.24","16.02.25","16.02.26","16.02.29"]
df = pd.DataFrame(raw_data, index=date, columns=["close", "high", "low", "open"])
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>close</th>
      <th>high</th>
      <th>low</th>
      <th>open</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>16.02.16</th>
      <td>11050</td>
      <td>11120</td>
      <td>10850</td>
      <td>10950</td>
    </tr>
    <tr>
      <th>16.02.17</th>
      <td>10800</td>
      <td>11300</td>
      <td>10800</td>
      <td>11150</td>
    </tr>
    <tr>
      <th>16.02.18</th>
      <td>11050</td>
      <td>11200</td>
      <td>10950</td>
      <td>11050</td>
    </tr>
    <tr>
      <th>16.02.19</th>
      <td>11050</td>
      <td>11100</td>
      <td>10800</td>
      <td>10950</td>
    </tr>
    <tr>
      <th>16.02.22</th>
      <td>10950</td>
      <td>11050</td>
      <td>10850</td>
      <td>10950</td>
    </tr>
    <tr>
      <th>16.02.23</th>
      <td>11050</td>
      <td>11150</td>
      <td>10900</td>
      <td>11000</td>
    </tr>
    <tr>
      <th>16.02.24</th>
      <td>11100</td>
      <td>11100</td>
      <td>10950</td>
      <td>11100</td>
    </tr>
    <tr>
      <th>16.02.25</th>
      <td>11000</td>
      <td>11200</td>
      <td>10900</td>
      <td>11200</td>
    </tr>
    <tr>
      <th>16.02.26</th>
      <td>11600</td>
      <td>11800</td>
      <td>11050</td>
      <td>11100</td>
    </tr>
    <tr>
      <th>16.02.29</th>
      <td>11900</td>
      <td>12100</td>
      <td>11600</td>
      <td>11650</td>
    </tr>
  </tbody>
</table>
</div>